---
kind: enumMember
id: F:Autodesk.Revit.DB.OrdinateDimensionLineStyle.Segmented
enum: Autodesk.Revit.DB.OrdinateDimensionLineStyle
source: html/6051744a-13fa-3a9d-d23b-07b2d29f87f4.htm
---
# Autodesk.Revit.DB.OrdinateDimensionLineStyle.Segmented

Segments the dimension line. Specify the length of the segments with the DimensionLineLength property.